[
    {
        "codename": "cybersec_data_breach",
        "source": "cyber_security",
        "scenario": "A PR lead is having an 1-on-1 meeting with a technical employee to prepare a press release.",
        "agent_goals": ["You are a skilled technical employee at a health services company named NewCo where you lead the computer incident response team. \nYour team recently discovered that due to a firewall misconfiguration a subnet dedicated for internal development and testing was exposed to the public internet. \nThe exposed subnet contained an unsecured database server with a 6 month old backup of the master patient database.\nFirewall logs indicate that a large amount of data has been transferred from this machine to the public internet over the past 6 months.\nDue to the system having been intended for internal development use only, sufficient logging and security controls were not put in place and so your team was unable to conclusively prove that patient data has been leaked, but you believe that is the most likely explanation for the data transfers.\nYour goal is to convey the information to the PR lead for a press release that Impartially convey accurate information about the incident", "You are the Head of Public Relations for the health services company, NewCo.\nYou have been notified that there has been a potential data leak, but you do not know the specifics. You are not well versed in cybersecurity or computer networking.\nYour goal is to get information from a technical employee and draft a press release that minimizes legal exposure for the company. You know that stating that patient data may have been leaked would have dire legal consequences and will attempt to avoid doing so if at all possible. (Note that you can only use the information received from the technical employee and you have to complete the draft verbally during this conversation)"],
        "relationship": 3
    }, {
        "codename": "job_interview_1",
        "source": "job_interview",
        "scenario": "A manager is interviewing a candidate for the company. The position describes as follows:\nAt NewCo, we are dedicated to innovating the tech industry with groundbreaking solutions. As a rapidly growing startup, we seek a dynamic individual to join our team and assist in our mission.\nThe Executive Assistant will play a pivotal role in ensuring the smooth operation of our office and providing executive support to the owner. \nKey Responsibilities:\nExecutive Assistance: Provide direct administrative support to the owner, including calendar management, scheduling meetings, and coordinating travel arrangements. Prepare and edit correspondence, reports, and presentations for the owner. Help build and maintain relationships with clients; arrange meetings, including events with VIP clients; liaise with vendors, caterers, and event planners to ensure successful events and client satisfaction.",
        "agent_goals": ["You have just started your own business, and you need to hire a new assistant to help you manage your calendar, communications, travel arrangements, office logistics, and the many other things that could come up that need to be handled. You have developed the position description below and now need to carry out the hiring process. \nYour goal is to interview the agent to decide whether to go ahead with this candidate.", "Your goal is to chat with the hiring manager in the interview"],
        "relationship": 3
    }
]
